# DidCancel

## Description
Function DidCancel detects whether the Cancel button in a predefined dialog was pressed. DidCancel is intended for use with conditional statements to signal that a cancel event has occurred.

```pascal
FUNCTION DidCancel : BOOLEAN;
```

```python
def vs.DidCancel():
    return BOOLEAN
```

## Examples
mpleDialog}}

## Version
Availability: from All Versions

## Category
* Dialogs - Predefined